tap "buo/cask-upgrade"
tap "daviderestivo/emacs-head"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "sunnyyoung/repo"
brew "aspell"
brew "blueutil"
brew "python@3.9"
brew "colima"
brew "coreutils"
brew "difftastic"
brew "direnv"
brew "docker"
brew "fcitx-remote-for-osx"
brew "fd"
brew "findutils"
brew "gawk"
brew "gh"
brew "git-lfs"
brew "gnupg"
brew "gnu-sed"
brew "gnu-tar"
brew "python@3.10"
brew "grep"
brew "node"
brew "iconsur"
brew "isync"
brew "jq"
brew "m-cli"
brew "mackup"
brew "mas"
brew "mist"
brew "moreutils"
brew "mu"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "pre-commit"
brew "pyright"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "subversion"
brew "switchaudio-osx"
brew "syncthing", restart_service: true
brew "tealdeer"
brew "terminal-notifier"
brew "tesseract"
brew "tesseract-lang"
brew "texlab"
brew "trash"
brew "tree"
brew "vim"
brew "wakatime-cli"
brew "wget"
brew "zoxide"
brew "daviderestivo/emacs-head/emacs-head@29", args: ["with-cocoa", "with-modern-icon-elrumo1", "with-native-comp", "with-tree-sitter", "with-xwidgets"]
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "aldente"
cask "arq"
cask "bartender", args: { appdir: "/Applications" }
cask "bettermouse"
cask "calibre"
cask "clashx-pro"
cask "dash", args: { appdir: "/Applications" }
cask "dropbox"
cask "firefox"
cask "focus"
cask "font-hanamina"
cask "font-noto-sans-cjk"
cask "font-noto-serif-cjk"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-source-code-pro"
cask "iina", args: { appdir: "/Applications" }
cask "inkscape"
cask "iterm2"
cask "kap", args: { appdir: "/Applications" }
cask "karabiner-elements"
cask "keycastr"
cask "launchbar", args: { appdir: "/Applications" }
cask "logitech-g-hub"
cask "mactex-no-gui"
cask "maczip"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "miniconda"
cask "monitorcontrol"
cask "omnidisksweeper", args: { appdir: "/Applications" }
cask "onedrive"
cask "skim", args: { appdir: "/Applications" }
cask "slack"
cask "squirrel", args: { appdir: "/Applications" }
cask "syntax-highlight"
cask "telegram"
cask "topnotch"
cask "tor-browser"
cask "wechattweak-cli"
cask "zotero"
mas "Bitwarden", id: 1352778147
mas "Bob", id: 1630034110
mas "Feishu", id: 1551632588
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MoneyWiz 3", id: 1012291524
mas "NetEaseMusic", id: 944848654
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
mas "QQ", id: 451108668
mas "Surfingkeys", id: 1609752330
mas "Take a Break", id: 1457158844
mas "Tampermonkey", id: 1482490089
mas "TencentMeeting", id: 1484048379
mas "WeChat", id: 836500024
