tap "daviderestivo/emacs-head"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "sunnyyoung/repo"
tap "tshu-w/malt"
tap "zurawiki/brews"
brew "beancount"
brew "node"
brew "bitwarden-cli"
brew "blueutil"
brew "coreutils"
brew "difftastic"
brew "direnv"
brew "enchant"
brew "fcitx-remote-for-osx"
brew "fd"
brew "findutils"
brew "flyctl"
brew "gawk"
brew "gh"
brew "git-lfs"
brew "gnupg"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "iconsur"
brew "isync"
brew "jq"
brew "librime"
brew "m-cli"
brew "mas"
brew "mist-cli"
brew "moreutils"
brew "mu"
brew "pandoc"
brew "pdm"
brew "pinentry-mac"
brew "pre-commit"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "screen"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "tealdeer"
brew "terminal-notifier"
brew "texlab"
brew "tinymist"
brew "tree"
brew "typst"
brew "unison"
brew "uv"
brew "vim"
brew "wget"
brew "zoxide"
brew "daviderestivo/emacs-head/emacs-head@31", args: ["with-cocoa", "with-modern-icon-elrumo1", "with-mps", "with-native-full-aot", "with-tree-sitter", "with-xwidgets"]
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "zurawiki/brews/gptcommit"
cask "aldente"
cask "arq"
cask "cherry-studio"
cask "dash", args: { appdir: "/Applications" }
cask "discord"
cask "dropbox"
cask "easydict"
cask "firefox"
cask "focus"
cask "font-blex-mono-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-fontawesome"
cask "font-hanamin"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-sc"
cask "font-ibm-plex-serif"
cask "font-inter"
cask "font-intone-mono-nerd-font"
cask "font-monolisa-custom"
cask "font-noto-sans-cjk-sc"
cask "font-noto-serif-cjk-sc"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-source-code-pro"
cask "google-chrome"
cask "iina", args: { appdir: "/Applications" }
cask "iterm2"
cask "jordanbaird-ice"
cask "kap", args: { appdir: "/Applications" }
cask "karabiner-elements"
cask "keycastr"
cask "launchbar", args: { appdir: "/Applications" }
cask "lookaway"
cask "macfuse"
cask "mactex-no-gui"
cask "maczip"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "miniconda"
cask "moneywiz"
cask "mouseless"
cask "onedrive"
cask "orbstack"
cask "skim"
cask "slack"
cask "squirrel-app"
cask "telegram"
cask "tencent-meeting"
cask "tor-browser"
cask "wechattweak-cli"
cask "wechatwork"
cask "zotero"
mas "Bitwarden", id: 1352778147
mas "Feishu", id: 1551632588
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
mas "QQ", id: 451108668
mas "Surfingkeys", id: 1609752330
mas "Userscripts", id: 1463298887
mas "WeChat", id: 836500024
