tap "homebrew/bundle"
brew "difftastic"
brew "direnv"
brew "emacs"
brew "gh"
brew "node"
brew "pipx"
brew "pre-commit"
brew "pyright"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "starship"
brew "stow"
brew "tealdeer"
brew "trash-cli"
brew "zip"
brew "zoxide"
