tap "homebrew/bundle"
tap "homebrew/core"
brew "direnv"
brew "gcc"
brew "gnutls"
brew "emacs", args: ["HEAD"]
brew "python@3.9"
brew "node"
brew "pipx"
brew "pre-commit"
brew "pyright"
brew "ripgrep"
brew "screen"
brew "starship"
brew "stow"
brew "tealdeer"
brew "trash-cli"
brew "wakatime-cli"
brew "zip"
brew "zoxide"
